CSI API ETABS v1
cDesignSteel.VerifySections Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int VerifySections(
	ref int NumberItems,
	ref string[] MyName
)
Function VerifySections (
	ByRef NumberItems As Integer,
	ByRef MyName As String()
) As Integer
Dim instance As cDesignSteel
Dim NumberItems As Integer
Dim MyName As String()
Dim returnValue As Integer
returnValue = instance.VerifySections(NumberItems,
	MyName)
int VerifySections(
	int% NumberItems,
	array<String^>^% MyName
)
abstract VerifySections :
        NumberItems : int byref *
        MyName : string[] byref -> int
Parameters
NumberItems
Type: System.Int32
MyName
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cDesignSteel Interface
ETABSv1 Namespace